EthanWu87/HOLTEK_Image_Classification_Project/v1.0.0/Data_Collection/Firmware/HT32F493x5_FWLib_V1.2.2_184/libraries/drivers/inc/ht32f493x5_usb.h
/*********************************************************************************************************//**
 * @file    ht32f493x5_usb.h
 * @version $Rev:: 128         $
 * @date    $Date:: 2025-05-08 #$
 * @brief   ht32f493x5 usb header file
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/** @addtogroup HT32F493x5_periph_driver
  * @{
  */

/** @addtogroup USB
  * @{
  */

/* define to prevent recursive inclusion -------------------------------------*/
#ifndef __HT32F493x5_USB_H
#define __HT32F493x5_USB_H

#ifdef __cplusplus
extern "C" {
#endif


/* includes ------------------------------------------------------------------*/
#include "ht32f493x5.h"



/** @defgroup USB_interrupts_definition
  * @brief usb interrupt mask
  * @{
  */

#define USB_LSOF_INT                     ((uint32_t)0x00000100) /*!< usb lost sof interrupt */
#define USB_SOF_INT                      ((uint32_t)0x00000200) /*!< usb sof interrupt */
#define USB_RST_INT                      ((uint32_t)0x00000400) /*!< usb reset interrupt */
#define USB_SP_INT                       ((uint32_t)0x00000800) /*!< usb suspend interrupt */
#define USB_WK_INT                       ((uint32_t)0x00001000) /*!< usb wakeup interrupt */
#define USB_BE_INT                       ((uint32_t)0x00002000) /*!< usb bus error interrupt */
#define USB_UCFOR_INT                    ((uint32_t)0x00004000) /*!< usb core fifo overrun interrupt */
#define USB_TC_INT                       ((uint32_t)0x00008000) /*!< usb transmission completed interrupt */

/**
  * @}
  */

/** @defgroup USB_interrupt_flags_definition
  * @brief usb interrupt flag
  * @{
  */

#define USB_EPT_NUM_FLAG                 ((uint32_t)0x0000000F) /*!< usb endpoint number */
#define USB_INOUT_FLAG                   ((uint32_t)0x00000010) /*!< usb in/out transcation flag */
#define USB_LSOF_FLAG                    ((uint32_t)0x00000100) /*!< usb lost sof flag */
#define USB_SOF_FLAG                     ((uint32_t)0x00000200) /*!< usb sof flag */
#define USB_RST_FLAG                     ((uint32_t)0x00000400) /*!< usb reset flag */
#define USB_SP_FLAG                      ((uint32_t)0x00000800) /*!< usb suspend flag */
#define USB_WK_FLAG                      ((uint32_t)0x00001000) /*!< usb wakeup flag */
#define USB_BE_FLAG                      ((uint32_t)0x00002000) /*!< usb bus error flag */
#define USB_UCFOR_FLAG                   ((uint32_t)0x00004000) /*!< usb core fifo overrun flag */
#define USB_TC_FLAG                      ((uint32_t)0x00008000) /*!< usb transmission completed flag */

/**
  * @}
  */

/** @defgroup USB_endpoint_register_bit_definition
  * @brief usb endpoint register bit define
  * @{
  */

#define USB_EPTADDR                      ((uint32_t)0x0000000F) /*!< usb endpoint address */
#define USB_TXSTS                        ((uint32_t)0x00000030) /*!< usb tx status */
#define USB_TXDTS                        ((uint32_t)0x00000040) /*!< usb tx data toggle synchronization */
#define USB_TXTC                         ((uint32_t)0x00000080) /*!< usb tx transcation completed */
#define USB_EXF                          ((uint32_t)0x00000100) /*!< usb endpoint extend funtion */
#define USB_TRANS_TYPE                   ((uint32_t)0x00000600) /*!< usb transfer type */
#define USB_SETUPTC                      ((uint32_t)0x00000800) /*!< usb setup transcation completed */
#define USB_RXSTS                        ((uint32_t)0x00003000) /*!< usb rx status */
#define USB_RXDTS                        ((uint32_t)0x00004000) /*!< usb rx data toggle synchronization */
#define USB_RXTC                         ((uint32_t)0x00008000) /*!< usb rx transcation completed */

#define USB_EPT_BIT_MASK                 (uint32_t)(USB_TXTC | USB_SETUPTC | USB_EPTADDR | USB_EXF | USB_RXTC | USB_TRANS_TYPE) /*!< usb bit mask */
#define USB_TX_MASK                      (USB_TXSTS | USB_EPT_BIT_MASK) /*!< usb tx mask */
#define USB_RX_MASK                      (USB_RXSTS | USB_EPT_BIT_MASK) /*!< usb rx mask */

/**
  * @}
  */

/** @defgroup USB_endpoint_tx_and_rx_status_definition
  * @brief usb endpoint tx and rx status
  * @{
  */

#define USB_TX_DISABLE                   ((uint32_t)0x00000000) /*!< usb tx status disable */
#define USB_TX_STALL                     ((uint32_t)0x00000010) /*!< usb tx status stall */
#define USB_TX_NAK                       ((uint32_t)0x00000020) /*!< usb tx status nak */
#define USB_TX_VALID                     ((uint32_t)0x00000030) /*!< usb tx status valid */

#define USB_TXDTS0                       ((uint32_t)0x00000010) /*!< usb tx data toggle bit 0 */
#define USB_TXDTS1                       ((uint32_t)0x00000020) /*!< usb tx data toggle bit 1 */

#define USB_RX_DISABLE                   ((uint32_t)0x00000000) /*!< usb rx status disable */
#define USB_RX_STALL                     ((uint32_t)0x00001000) /*!< usb rx status stall */
#define USB_RX_NAK                       ((uint32_t)0x00002000) /*!< usb rx status nak */
#define USB_RX_VALID                     ((uint32_t)0x00003000) /*!< usb rx status valid */

