EthanWu87/HOLTEK_Image_Classification_Project/v1.0.0/Data_Collection/Firmware/HT32F493x5_FWLib_V1.2.2_184/libraries/drivers/inc/ht32f493x5_usb.h
#define USB_RXDTS0                       ((uint32_t)0x00001000) /*!< usb rx data toggle bit 0 */
#define USB_RXDTS1                       ((uint32_t)0x00002000) /*!< usb rx data toggle bit 1 */

/**
  * @}
  */

/** @defgroup USB_device_endpoint_register_type_definition
  * @brief usb device endpoint register type define
  * @{
  */

#define USB_EPT_CONTROL                  ((uint32_t)0x00000200) /*!< usb endpoint transfer type control */
#define USB_EPT_BULK                     ((uint32_t)0x00000000) /*!< usb endpoint transfer type bulk */
#define USB_EPT_INT                      ((uint32_t)0x00000600) /*!< usb endpoint transfer type interrupt */
#define USB_EPT_ISO                      ((uint32_t)0x00000400) /*!< usb endpoint transfer type iso */

/**
  * @}
  */

/** @defgroup USB_buffer_table_default_offset_address_definition
  * @brief usb buffer table default offset address
  * @{
  */

#define USB_BUFFER_TABLE_ADDRESS          0x0000 /*!< usb buffer table address */

/**
  * @}
  */

/** @defgroup USB_packet_buffer_start_address_definition
  * @brief usb packet buffer start address
  * @{
  */

#define USB_PACKET_BUFFER_ADDRESS         0x40006000 /*!< usb buffer address */
#define USB_PACKET_BUFFER_ADDRESS_EX      0x40007800 /*!< usb buffer extend address */

/**
  * @}
  */

/** @defgroup USB_exported_enum_types
  * @{
  */

/**
  * @brief usb endpoint number define
  */
typedef enum
{
  USB_EPT0                               = 0x00, /*!< usb endpoint 0 */
  USB_EPT1                               = 0x01, /*!< usb endpoint 1 */
  USB_EPT2                               = 0x02, /*!< usb endpoint 2 */
  USB_EPT3                               = 0x03, /*!< usb endpoint 3 */
  USB_EPT4                               = 0x04, /*!< usb endpoint 4 */
  USB_EPT5                               = 0x05, /*!< usb endpoint 5 */
  USB_EPT6                               = 0x06, /*!< usb endpoint 6 */
  USB_EPT7                               = 0x07  /*!< usb endpoint 7 */
} usb_ept_number_type;

/**
  * @brief usb endpoint max num define
  */
#ifndef USB_EPT_MAX_NUM
#define USB_EPT_MAX_NUM                   8  /*!< usb device support endpoint number */
#endif
/**
  * @brief endpoint transfer type define
  */
typedef enum
{
  EPT_CONTROL_TYPE                       = 0x00, /*!< usb transfer type control */
  EPT_ISO_TYPE                           = 0x01, /*!< usb transfer type iso */
  EPT_BULK_TYPE                          = 0x02, /*!< usb transfer type bulk */
  EPT_INT_TYPE                           = 0x03  /*!< usb transfer type interrupt */
}ept_trans_type;

/**
  * @brief endpoint endpoint direction define
  */
typedef enum
{
  EPT_IN                                 = 0x00, /*!< usb endpoint direction in */
  EPT_OUT                                = 0x01  /*!< usb endpoint direction out */
}ept_inout_type;

/**
  * @brief data transfer direction
  */
typedef enum
{
  DATA_TRANS_OUT                         = 0x00, /*!< usb data transfer direction out */
  DATA_TRANS_IN                          = 0x01  /*!< usb data transfer direction in */
}data_trans_dir;

/**
  * @brief usb clock select
  */
typedef enum
{
  USB_CLK_HICK,
  USB_CLK_HEXT
}usb_clk48_s;
/**
  * @}
  */

/** @defgroup USB_macro_definition
  * @{
  */

/**
  * @brief  set usb endpoint tx status
  * @param  ept_num: endpoint number
  * @param  new_sts: the new tx status of this endpoint number
  * @retval none
  */
#define USB_SET_TXSTS(ept_num, new_sts) { \
  register uint16_t epsts = (USB->ept[ept_num]) & USB_TX_MASK; \
  if((new_sts & USB_TXDTS0) != 0)                    \
    epsts ^= USB_TXDTS0;                             \
  if((new_sts & USB_TXDTS1) != 0)                    \
    epsts ^= USB_TXDTS1;                             \
  USB->ept[ept_num] = epsts | USB_RXTC | USB_TXTC; \
}

/**
  * @brief  set usb endpoint rx status
  * @param  ept_num: endpoint number
  * @param  new_sts: the new rx status of this endpoint number
  * @retval none
  */
#define USB_SET_RXSTS(ept_num, new_sts) { \
  register uint16_t epsts = (USB->ept[ept_num]) & USB_RX_MASK; \
  if((new_sts & USB_RXDTS0) != 0) \
    epsts ^= USB_RXDTS0; \
  if((new_sts & USB_RXDTS1) != 0) \
    epsts ^= USB_RXDTS1; \
  USB->ept[ept_num] = epsts | USB_RXTC | USB_TXTC; \
}

/**
  * @brief  get usb endpoint tx/rx length address
  * @param  eptn: endpoint number
  * @retval the length address of tx/rx
  */
#define GET_TX_LEN_ADDR(eptn) (uint32_t *)((USB->buftbl + eptn * 8 + 2) * 2 + g_usb_packet_address)
#define GET_RX_LEN_ADDR(eptn) (uint32_t *)((USB->buftbl + eptn * 8 + 6) * 2 + g_usb_packet_address)

/**
  * @brief  get usb endpoint tx/rx data length
  * @param  eptn: endpoint number
  * @retval the length of tx/rx
  */
#define USB_GET_TX_LEN(eptn)  ((uint16_t)(*GET_TX_LEN_ADDR(eptn)) & 0x3ff)
#define USB_GET_RX_LEN(eptn)  ((uint16_t)(*GET_RX_LEN_ADDR(eptn)) & 0x3ff)

/**
  * @brief  double buffer mode get endpoint buf0/buf1 data length
  * @param  eptn: endpoint number
  * @retval the length of buf0/buf1
  */
#define USB_DBUF0_GET_LEN(eptn) USB_GET_TX_LEN(eptn)
#define USB_DBUF1_GET_LEN(eptn) USB_GET_RX_LEN(eptn)

/**
  * @brief  set usb length of rx buffer
  * @param  reg: usb rx length register
  * @param  len: rx max length
  * @param  blks: number of blocks
  */
#define BLK32(reg, len, blks) { \
  blks = (len) >> 5; \
  if(((len) & 0x1F) == 0) \
    blks --; \
  *reg = ((uint16_t)((blks) << 10) | 0x8000); \
}

#define BLK2(reg, len, blks) { \
  blks = (len) >> 1; \
  if(((len) & 0x1) == 0) \
    blks ++; \
  *reg = (uint16_t)((blks) << 10); \
}

#define USB_SET_RXLEN_REG(reg, len) { \
  uint16_t blks;                         \
  if(len > 62)                         \
  {                                      \
    BLK32(reg, len, blks);             \
  }                                      \
  else                                   \
  {                                      \
    BLK2(reg, len, blks);              \
  }                                      \
}

/**
  * @brief  set endpoint tx/rx transfer length
  * @param  eptn: endpoint number
  * @param  len: transfer length
  * @retval none
  */
#define USB_SET_TXLEN(eptn, len) (*(GET_TX_LEN_ADDR(eptn)) = (len))
#define USB_SET_RXLEN(eptn, len) { \
  uint32_t *rx_reg = GET_RX_LEN_ADDR(eptn); \
  USB_SET_RXLEN_REG(rx_reg, (len)); \
}

/**
  * @brief  double buffer mode set endpoint rx buf0 length
  * @param  eptn: endpoint number
  * @param  len: transfer length
  * @retval none
  */
#define USB_OUT_EPT_DOUBLE_BUF0(eptn, len) { \
  uint32_t *rx_reg = GET_TX_LEN_ADDR(eptn); \
  USB_SET_RXLEN_REG(rx_reg, (len)); \
}

/**
  * @brief  double buffer mode set endpoint buf0 length
  * @param  eptn: endpoint number
  * @param  len: transfer length
  * @param  dir: transfer direction(in/out)
  * @retval none
  */
#define USB_SET_EPT_DOUBLE_BUF0_LEN(eptn, len, dir) { \
  if(dir == DATA_TRANS_OUT) \
  { \
    USB_OUT_EPT_DOUBLE_BUF0(eptn, len); \
  } \
  else \
  { \
    *(GET_TX_LEN_ADDR(eptn)) = (len); \
  } \
}

/**
  * @brief  double buffer mode set endpoint buf1 length
  * @param  eptn: endpoint number
  * @param  len: transfer length
  * @param  dir: transfer direction(in/out)
  * @retval none
  */
#define USB_SET_EPT_DOUBLE_BUF1_LEN(eptn, len, dir) { \
  if(dir == DATA_TRANS_OUT) \
  { \
    USB_SET_RXLEN(eptn, len); \
  } \
  else \
  { \
    *(GET_RX_LEN_ADDR(eptn)) = (len); \
  } \
}

/**
  * @brief  set usb endpoint tx/rx fifo address
  * @param  eptn: endpoint number
  * @param  address: offset of the fifo address
  * @retval none
  */
#define USB_SET_TX_ADDRESS(eptn, address) (*(uint32_t *)((USB->buftbl + eptn * 8) * 2 + g_usb_packet_address) = address)
#define USB_SET_RX_ADDRESS(eptn, address) (*(uint32_t *)((USB->buftbl + eptn * 8 + 4) * 2 + g_usb_packet_address) = address)

/**
  * @brief  set double buffer mode usb endpoint buf0/buf1 fifo address
  * @param  eptn: endpoint number
  * @param  address: offset of the fifo address
  * @retval none
  */
#define USB_SET_DOUBLE_BUFF0_ADDRESS(eptn, address) (USB_SET_TX_ADDRESS(eptn, address))
#define USB_SET_DOUBLE_BUFF1_ADDRESS(eptn, address) (USB_SET_RX_ADDRESS(eptn, address))

/**
  * @brief  set usb tx/rx toggle
  * @param  eptn: endpoint number
  * @retval none
  */
#define USB_TOGGLE_TXDTS(eptn) (USB->ept[eptn] = ((USB->ept[eptn] & USB_EPT_BIT_MASK) | USB_TXDTS | USB_RXTC | USB_TXTC))
#define USB_TOGGLE_RXDTS(eptn) (USB->ept[eptn] = ((USB->ept[eptn] & USB_EPT_BIT_MASK) | USB_RXDTS | USB_RXTC | USB_TXTC))

/**
  * @brief  clear usb tx/rx toggle
  * @param  eptn: endpoint number
  * @retval none
  */
#define USB_CLEAR_TXDTS(eptn) { \
  if(USB->ept_bit[eptn].txdts != 0) \
    USB_TOGGLE_TXDTS(eptn); \
}
#define USB_CLEAR_RXDTS(eptn) { \
  if(USB->ept_bit[eptn].rxdts != 0) \
    USB_TOGGLE_RXDTS(eptn); \
}

/**
  * @brief set usb endpoint type
  */

/**
  * @brief  set usb transfer type
  * @param  eptn: endpoint number
  * @param  type: transfer type
  * @retval none
  */
#define USB_SET_TRANS_TYPE(eptn, type) (USB->ept[eptn] = (USB->ept[eptn] & USB_EPT_BIT_MASK & (~USB_TRANS_TYPE)) | type)

/**
  * @brief  set/clear usb extend function
  * @param  eptn: endpoint number
  * @retval none
  */
#define USB_SET_EXF(eptn) (USB->ept[eptn] = USB_TXTC | USB_RXTC | ((USB->ept[eptn] | USB_EXF) & USB_EPT_BIT_MASK))
#define USB_CLEAR_EXF(eptn) (USB->ept[eptn] = USB_TXTC | USB_RXTC | (USB->ept[eptn] & ((~USB_EXF) & USB_EPT_BIT_MASK)))

/**
  * @brief  set usb device address
  * @param  eptn: endpoint number
  * @param  address: device address
  * @retval none
  */
#define USB_SET_EPT_ADDRESS(eptn, address) (USB->ept[eptn] = ((USB->ept[eptn] & USB_EPT_BIT_MASK & (~USB_EPTADDR)) | address))

/**
  * @brief  free buffer used by application
  * @param  eptn: endpoint number
  * @param  inout: transfer direction
  * @retval none
  */
#define USB_FREE_DB_USER_BUFFER(eptn, inout) { \
  if(inout == DATA_TRANS_IN) \
  { \
    USB_TOGGLE_RXDTS(eptn); \
  } \
  else \
  { \
    USB_TOGGLE_TXDTS(eptn); \
  } \
}

/**
  * @brief  clear tx/rx transfer completed flag
  * @param  eptn: endpoint number
  * @retval none
  */
#define USB_CLEAR_TXTC(eptn)    (USB->ept[eptn] &= 0xFF7F & USB_EPT_BIT_MASK)
#define USB_CLEAR_RXTC(eptn)    (USB->ept[eptn] &= 0x7FFF & USB_EPT_BIT_MASK)

/**
  * @brief  set/clear endpoint double buffer mode
  * @param  eptn: endpoint number
  * @retval none
  */
#define USB_SET_EPT_DOUBLE_BUFFER(eptn)   USB_SET_EXF(eptn)
#define USB_CLEAR_EPT_DOUBLE_BUFFER(eptn) USB_CLEAR_EXF(eptn)

/**
  * @}
  */

/** @defgroup USB_exported_types
  * @{
  */

/**
  * @brief  usb endpoint infomation structure definition
  */
typedef struct
{
  uint8_t                                eptn;                        /*!< endpoint register number (0~7) */
  uint8_t                                ept_address;                 /*!< endpoint address */
  uint8_t                                inout;                       /*!< endpoint dir DATA_TRANS_IN or DATA_TRANS_OUT */
  uint8_t                                trans_type;                  /*!< endpoint type:
                                                                           EPT_CONTROL_TYPE, EPT_BULK_TYPE, EPT_INT_TYPE, EPT_ISO_TYPE*/
  uint16_t                               tx_addr;                     /*!< endpoint tx buffer offset address */
  uint16_t                               rx_addr;                     /*!< endpoint rx buffer offset address */
  uint16_t                               maxpacket;                   /*!< endpoint max packet*/
  uint8_t                                is_double_buffer;            /*!< endpoint double buffer flag */
  uint8_t                                stall;                       /*!< endpoint is stall state */
  uint16_t                               status;                      /*!< endpoint status */

